{ "__v" : 0, "_id" : { "$oid" : "5574f26356a0f67306058d4a" }, "con" : [ { "content" : "There is a high likelihood that there will not be an agreement reached cross-culturally on what should and should not be private...", "_id" : { "$oid" : "55ce0a2dd0fba8ee01d3d96c" }, "support" : [ { "content" : "", "_id" : { "$oid" : "55ce0a7fd0fba8ee01d3d973" } } ] }, { "content" : "Do we really want google to be policemen of information removed just because they regret their actions.  The right to be forgotten is no longer a reality in this day and age.  Google is just an archived data source. All google is doing is showing information from other publicly posted sites. Why is it google's responsibility to be the policeman of the internet.  The feasibility of handling a task like this is pretty much unreasonable.  It's like thinking the government is coming to take your guns, it's pretty much impossible.  Who ends up in charge of regulating all of this?  Who has or does not have the right to take down information in contrast with someone who wans it left up is a grey area.", "_id" : { "$oid" : "5599747b1cf5db4d0754690c" }, "support" : [ { "content" : "", "_id" : { "$oid" : "55ce0675d0fba8ee01d3d964" } }, { "content" : "Teenagers do act immaturely. But also, in the US the age 18 symbolizes entrance to adulthood. People aged 18 and over can be sent to war and die, so perhaps these teenagers need to be shown that actions have consequences. We are already the most coddled generation in the history. If you don't want the world to see then don't post it. ", "_id" : { "$oid" : "55ce0369d0fba8ee01d3d960" } } ] }, { "content" : "...Search engines do not possess the ability to handle the implementation of right to be forgotten legislation.", "_id" : { "$oid" : "559973181cf5db4d07546907" }, "support" : [ { "content" : "Over the first five months after the decision was handed down, Google received approximately 143,000 de-indexation requests relat-ed to 491,000 links.2decision ignores the problem of how to effectuate efficiently but fairly these requests and the thousands more that will follow.", "_id" : { "$oid" : "559fdba61c70ff9363f39198" } }, { "content" : "", "_id" : { "$oid" : "559973e81cf5db4d0754690b" } } ] }, { "content" : "", "_id" : { "$oid" : "55949cb6047a5a8a0348b38a" }, "support" : [ { "content" : "", "_id" : { "$oid" : "559fdc9a1c70ff9363f3919a" } } ] }, { "content" : "...A civilized internet is one where people are held responsible for their actions and behavior", "_id" : { "$oid" : "55942f14f04f330a168d5b8d" }, "support" : [ { "content" : "", "_id" : { "$oid" : "55943022f04f330a168d5b90" } }, { "content" : "", "_id" : { "$oid" : "55942fe1f04f330a168d5b8f" } } ] }, { "content" : "...", "_id" : { "$oid" : "559ff2141c70ff9363f391a3" }, "support" : [ { "content" : "", "_id" : { "$oid" : "559ff27e1c70ff9363f391a6" } }, { "content" : "", "_id" : { "$oid" : "559ff26b1c70ff9363f391a5" } } ] } ], "pro" : [ { "content" : "", "_id" : { "$oid" : "55ce0a2dd0fba8ee01d3d96d" }, "support" : [] }, { "content" : "People have the right to be forgotten since anyone can have some misconduct and deserve to be forgiven as long as he/she has paid the price.", "_id" : { "$oid" : "5599747b1cf5db4d0754690d" }, "support" : [ { "content" : "Teenagers may act immaturely or irrationally that has no reason to accompany them to bring sense of humiliation and miserable feelings. ", "_id" : { "$oid" : "559fdac91c70ff9363f39192" } }, { "content" : "The embarrassments of conducts at young age should not exert perpetual influence on the rest of one's life and the right to be forgotten can protect people from getting endless rebuke, consoles or explanations.", "_id" : { "$oid" : "559fdaac1c70ff9363f39190" } } ] }, { "content" : "Search engine operators have already got the competency to fulfill the obligation required by the right to be forgotten.", "_id" : { "$oid" : "559973181cf5db4d07546908" }, "support" : [ { "content" : "Google and other search engines have experience with handling massive amounts of de-indexation requests related to alleged infringement of intellectual property rights, the logistics of which is quite similar.", "_id" : { "$oid" : "559973641cf5db4d0754690a" } }, { "content" : "Related authorities, such as European data protection authorities, have shown willingness to assist, for instance, in drawing guidelines to ensure consistency.", "_id" : { "$oid" : "5599733f1cf5db4d07546909" } } ] }, { "content" : "The right to be forgotten should be protected since it takes action and efforts to establish new social standard in the progress of civilization.", "_id" : { "$oid" : "55949cb6047a5a8a0348b38b" }, "support" : [ { "content" : "European countries and South American countries, such as Argentina have demonstrated efforts in building up the right to be forgotten and it seems to work as people benefit from the protect and care about their records online.", "_id" : { "$oid" : "559fe2cf1c70ff9363f391a0" } }, { "content" : "The crime victims or criminals have the right to let go of the past, and the cost to facilitate the process is just a matter of time and efforts. As long as new framework in support of the emergent human right is established, the Internet world will be more manageable.", "_id" : { "$oid" : "5595456e047a5a8a0348b38c" } } ] }, { "content" : "The regulation on the right to be forgotten is necessary step towards more civilized Internet world.", "_id" : { "$oid" : "55942f14f04f330a168d5b8e" }, "support" : [ { "content" : "The crime victims or criminals have the right to let go of the past, and the cost to facilitate the process is just a matter of time and efforts. As long as new infrastructor is established, the Internet world will be more desirable.", "_id" : { "$oid" : "559430f8f04f330a168d5b91" } } ] }, { "content" : "The right to be forgotten rings a bell for us on the fight for our rights even in the virtual world at the digital age.", "_id" : { "$oid" : "559ff2141c70ff9363f391a4" }, "support" : [ { "content" : "Before the digital age, humans enjoyed the right of letting go of the regretful past, in the offline world, whereas people nowadays suffer from malicious attacks from the past, even if it has become irrelevant to the person's present life.", "_id" : { "$oid" : "559ff4081c70ff9363f391a8" } }, { "content" : "The data rentention issue provides us a different view on the rights we can benefit from, and we should protect our privacy even harder on the Internet, where rumours goes faster and wider.", "_id" : { "$oid" : "559ff3791c70ff9363f391a7" } } ] } ], "topic" : "THE RIGHT TO BE FORGOTTEN" }
