{ "__v" : 0, "_id" : { "$oid" : "5574f26356a0f67306058d4a" }, "con" : [ { "content" : "Citizens have the right to know the truth as long as the information was legally acquired.", "_id" : { "$oid" : "5599747b1cf5db4d0754690c" }, "support" : [ { "content" : "The U.S. Supreme Court has held that states cannot pass laws restricting the media from disseminating truthful but embarrassing information—such as the name of a rape victim—as long as the information was legally acquired.", "_id" : { "$oid" : "559fdafc1c70ff9363f39196" } }, { "content" : "People who have seen the original post acquired knowledge or point of view regardless of whether the original poster regrets doing so or not. The right to tell others have been propagated to a wider scope, which is no longer the privacy of a single person.", "_id" : { "$oid" : "559fdaf81c70ff9363f39194" } } ] }, { "content" : "Assigned legal party, instead of third party, such as Google or Yahoo, should take the responsibility to arbitrate the dispute.", "_id" : { "$oid" : "559973181cf5db4d07546907" }, "support" : [ { "content" : "The guidance on assessment criteria that can be applied to the tremendous number of de-indexation requests is still absent, which makes it a hard position in the delicate balacing exercises.", "_id" : { "$oid" : "559fdba61c70ff9363f39198" } }, { "content" : "IT companies should not be liable for the moody behaviors of all the users as big parents. The additional cost may curtail the development on such technologies that assist with computer-mediated communication.", "_id" : { "$oid" : "559973e81cf5db4d0754690b" } } ] }, { "content" : "The right to be forgotten should be postponed before an execution and inspection procedure is specified.", "_id" : { "$oid" : "55949cb6047a5a8a0348b38a" }, "support" : [ { "content" : "The ambiguous situations may lead to deleting as the preferred measures by the third party to avoid accusation of negligence, or enormous fine, or even simply to save the trouble.", "_id" : { "$oid" : "559fdc9a1c70ff9363f3919a" } } ] }, { "content" : "The right to be forgotten leads to misfunctions of Internet services, such as returning blank pages from search engines and deleting photos on ambiguous situations. ", "_id" : { "$oid" : "55942f14f04f330a168d5b8d" }, "support" : [ { "content" : "The role of censor-in-chief is hard to be integrated into commercial companies, and decisions from the technology companies may lead to more controversial disputes.", "_id" : { "$oid" : "55943022f04f330a168d5b90" } }, { "content" : "The frequent deleting issues will exert a considerable amount additional burden/workload on the Internet Service Providers.", "_id" : { "$oid" : "55942fe1f04f330a168d5b8f" } } ] },{ "content" : "The right to be forgotten is in conflicts with existing rights, such as freedom of speech and open access of Internet etc.", "_id" : { "$oid" : "559ff2141c70ff9363f391a3" }, "support" : [ { "content" : "The abuse of the right to be forgetten may lead to constant, or dramastically frequent uploads and deletes, which causes waste on Internet resources, malicious comments/rumours and useless visiting attmepts and confusions", "_id" : { "$oid" : "559ff27e1c70ff9363f391a6" } }, { "content" : "The first amendment has been dedicated to protect human's freedom of speech as the highest order, which means when things in conflict, this regulation will not work.", "_id" : { "$oid" : "559ff26b1c70ff9363f391a5" } } ] } ], "pro" : [ { "content" : "People have the right to be forgotten since anyone can have some misconduct and deserve to be forgiven as long as he/she has paid the price.", "_id" : { "$oid" : "5599747b1cf5db4d0754690d" }, "support" : [ { "content" : "Teenagers may act immaturely or irrationally that has no reason to accompany them to bring sense of humiliation and miserable feelings. ", "_id" : { "$oid" : "559fdac91c70ff9363f39192" } }, { "content" : "The embarrassments of conducts at young age should not exert perpetual influence on the rest of one's life and the right to be forgotten can protect people from getting endless rebuke, consoles or explanations.", "_id" : { "$oid" : "559fdaac1c70ff9363f39190" } } ] }, { "content" : "Search engine operators have already got the competency to fulfill the obligation required by the right to be forgotten.", "_id" : { "$oid" : "559973181cf5db4d07546908" }, "support" : [ { "content" : "Google and other search engines have experience with handling massive amounts of de-indexation requests related to alleged infringement of intellectual property rights, the logistics of which is quite similar.", "_id" : { "$oid" : "559973641cf5db4d0754690a" } }, { "content" : "Related authorities, such as European data protection authorities, have shown willingness to assist, for instance, in drawing guidelines to ensure consistency.", "_id" : { "$oid" : "5599733f1cf5db4d07546909" } } ] }, { "content" : "The right to be forgotten should be protected since it takes action and efforts to establish new social standard in the progress of civilization.", "_id" : { "$oid" : "55949cb6047a5a8a0348b38b" }, "support" : [ { "content" : "European countries and South American countries, such as Argentina have demonstrated efforts in building up the right to be forgotten and it seems to work as people benefit from the protect and care about their records online.", "_id" : { "$oid" : "559fe2cf1c70ff9363f391a0" } }, { "content" : "The crime victims or criminals have the right to let go of the past, and the cost to facilitate the process is just a matter of time and efforts. As long as new framework in support of the emergent human right is established, the Internet world will be more manageable.", "_id" : { "$oid" : "5595456e047a5a8a0348b38c" } } ] }, { "content" : "The regulation on the right to be forgotten is necessary step towards more civilized Internet world.", "_id" : { "$oid" : "55942f14f04f330a168d5b8e" }, "support" : [ { "content" : "The crime victims or criminals have the right to let go of the past, and the cost to facilitate the process is just a matter of time and efforts. As long as new infrastructor is established, the Internet world will be more desirable.", "_id" : { "$oid" : "559430f8f04f330a168d5b91" } } ] }, { "content" : "The right to be forgotten rings a bell for us on the fight for our rights even in the virtual world at the digital age.", "_id" : { "$oid" : "559ff2141c70ff9363f391a4" }, "support" : [ { "content" : "Before the digital age, humans enjoyed the right of letting go of the regretful past, in the offline world, whereas people nowadays suffer from malicious attacks from the past, even if it has become irrelevant to the person's present life.", "_id" : { "$oid" : "559ff4081c70ff9363f391a8" } }, { "content" : "The data rentention issue provides us a different view on the rights we can benefit from, and we should protect our privacy even harder on the Internet, where rumours goes faster and wider.", "_id" : { "$oid" : "559ff3791c70ff9363f391a7" } } ] } ], "topic" : "The right to be forgotten" }
